In [1]:
import pandas as pd

In [3]:
data = {
    'name':['a','b','c','d'],
    'age' : [10,20,30,40],
    'city': ['x','y','v','z']
    
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  name  age city
0    a   10    x
1    b   20    y
2    c   30    v
3    d   40    z

In [6]:
print(df)

  name  age city
0    a   10    x
1    b   20    y
2    c   30    v
3    d   40    z

In [7]:
df['name']

0    a
1    b
2    c
3    d
Name: name, dtype: object

In [19]:
df.to_csv('friends.csv')

In [21]:
df.to_csv('friends.csv',index= False)

In [12]:
df

  name  age city
0    a   10    x
1    b   20    y
2    c   30    v
3    d   40    z

In [22]:
df.to_csv('friends.csv')

In [23]:
df.head(2)

  name  age city
0    a   10    x
1    b   20    y

In [24]:
df.tail(2)

  name  age city
2    c   30    v
3    d   40    z

In [26]:
df.describe()

             age
count   4.000000
mean   25.000000
std    12.909944
min    10.000000
25%    17.500000
50%    25.000000
75%    32.500000
max    40.000000

In [28]:
siddhi = pd.read_csv('friends.csv')

In [29]:
siddhi

   Unnamed: 0 name  age city
0           0    a   10    x
1           1    b   20    y
2           2    c   30    v
3           3    d   40    z

In [41]:
a = [1,2,3,4,5]
ser = pd.Series(a , index=['x','y','z','v','w'])
ser

x    1
y    2
z    3
v    4
w    5
dtype: int64

In [49]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data,index=['d1','d2','d3'])

print(df)

    calories  duration
d1       420        50
d2       380        40
d3       390        45

In [52]:
df.loc['d1']

calories    420
duration     50
Name: d1, dtype: int64

In [54]:
df.loc['d2']

calories    380
duration     40
Name: d2, dtype: int64

In [55]:
df.loc[['d1','d2']]

    calories  duration
d1       420        50
d2       380        40

In [56]:
##reading data from csv
import pandas as pd

In [57]:
siddhi = pd.read_csv('friends.csv')

In [58]:
siddhi

   Unnamed: 0 name  age city
0           0    a   10    x
1           1    b   20    y
2           2    c   30    v
3           3    d   40    z

In [59]:
siddhi.to_string()

'   Unnamed: 0 name  age city\n0           0    a   10    x\n1           1    b   20    y\n2           2    c   30    v\n3           3    d   40    z'

In [60]:
pd.option.dispaly.max_rows

AttributeError: module 'pandas' has no attribute 'option'

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, d1 to d3
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   calories  3 non-null      int64
 1   duration  3 non-null      int64
dtypes: int64(2)
memory usage: 180.0+ bytes

In [62]:
df.describe()

         calories  duration
count    3.000000       3.0
mean   396.666667      45.0
std     20.816660       5.0
min    380.000000      40.0
25%    385.000000      42.5
50%    390.000000      45.0
75%    405.000000      47.5
max    420.000000      50.0